In [1]:
import pandas as pd

In [2]:
dic_data = {"c0": [1, 2, 3], "c1": [4, 5, 6], "c2": [7, 8, 9], "c3": [10, 11, 12], "c4": [13, 14, 15]}

In [3]:
df = pd.DataFrame(dic_data)

In [4]:
df

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

In [5]:
type(df)

pandas.core.frame.DataFrame

In [8]:
df = pd.DataFrame([
    [15, "male", "덕영중"],
    [17, "female", "수리중"]],
    index=["준서", "예은"],
    columns=["age", "성별", "school"]
)

In [9]:
df

    age      성별 school
준서   15    male    덕영중
예은   17  female    수리중

In [10]:
df.index

Index(['준서', '예은'], dtype='object')

In [11]:
df.columns

Index(['age', '성별', 'school'], dtype='object')

In [12]:
df.index = ["student1", "student2"]
df.columns = ["연령", "남녀", "소속"]

In [13]:
df

          연령      남녀   소속
student1  15    male  덕영중
student2  17  female  수리중

In [14]:
df.index

Index(['student1', 'student2'], dtype='object')

In [15]:
df.columns

Index(['연령', '남녀', '소속'], dtype='object')

In [21]:
df = pd.DataFrame([
    [15, "male", "덕영중"],
    [17, "female", "수리중"]],
    index=["준서", "예은"],
    columns=["age", "sex", "school"]
)

In [22]:
df

    age     sex school
준서   15    male    덕영중
예은   17  female    수리중

In [18]:
df.rename(columns={"age":"나이", "sex":"성별", "school":"학교"}, inplace=True)

In [19]:
df

    나이      성별   학교
준서  15    male  덕영중
예은  17  female  수리중

In [23]:
df.rename(index={"준서":"student1", "예은":"student2"}, inplace=True)

In [24]:
df

          age     sex school
student1   15    male    덕영중
student2   17  female    수리중

In [25]:
exam_data = {"Math": [90, 80, 70], "English": [98, 89, 95], 
            "Music": [85, 95, 100], "Physical education": [100, 90, 90]}
df = pd.DataFrame(exam_data, index=["서준", "우현", "인아"])

In [26]:
df

    Math  English  Music  Physical education
서준    90       98     85                 100
우현    80       89     95                  90
인아    70       95    100                  90

In [27]:
df2 = df[:]

In [28]:
df2.drop("우현", inplace=True)

C:\ai\Anaconda3\lib\site-packages\pandas\core\frame.py:4102: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [29]:
df2

    Math  English  Music  Physical education
서준    90       98     85                 100
인아    70       95    100                  90

In [30]:
df3 = df[:]

In [31]:
df3.drop(["우현", "인아"], axis=0, inplace=True)

C:\ai\Anaconda3\lib\site-packages\pandas\core\frame.py:4102: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [32]:
df3

    Math  English  Music  Physical education
서준    90       98     85                 100

In [33]:
df4 = df[:]

In [37]:
df4.drop("Math", axis=1, inplace=True)

C:\ai\Anaconda3\lib\site-packages\pandas\core\frame.py:4102: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [38]:
df4

    English  Music  Physical education
서준       98     85                 100
우현       89     95                  90
인아       95    100                  90

In [39]:
df5 = df[:]

In [40]:
df5.drop(["English", "Music"], axis=1, inplace=True)

C:\ai\Anaconda3\lib\site-packages\pandas\core\frame.py:4102: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [41]:
df5

    Math  Physical education
서준    90                 100
우현    80                  90
인아    70                  90

In [45]:
ab = {"Chem": [1, 2, 3], "Math": [1, 2, 3]}

In [46]:
se = pd.Series(ab)

In [47]:
se

Chem    [1, 2, 3]
Math    [1, 2, 3]
dtype: object

In [48]:
type(se)

pandas.core.series.Series

In [49]:
df

    Math  English  Music  Physical education
서준    90       98     85                 100
우현    80       89     95                  90
인아    70       95    100                  90

In [50]:
df3

    Math  English  Music  Physical education
서준    90       98     85                 100

In [52]:
df6 =df[:]

In [53]:
df6

    Math  English  Music  Physical education
서준    90       98     85                 100
우현    80       89     95                  90
인아    70       95    100                  90

In [55]:
df6 = df.drop(["서준", "우현"])

In [56]:
df6

    Math  English  Music  Physical education
인아    70       95    100                  90

In [57]:
exam_data

{'Math': [90, 80, 70],
 'English': [98, 89, 95],
 'Music': [85, 95, 100],
 'Physical education': [100, 90, 90]}

In [58]:
df = pd.DataFrame(exam_data, index=["서준", "우현", "인아"])

In [59]:
df

    Math  English  Music  Physical education
서준    90       98     85                 100
우현    80       89     95                  90
인아    70       95    100                  90

In [60]:
label = df.loc["서준"]

In [61]:
label

Math                   90
English                98
Music                  85
Physical education    100
Name: 서준, dtype: int64

In [63]:
position = df.iloc[0]

In [64]:
position

Math                   90
English                98
Music                  85
Physical education    100
Name: 서준, dtype: int64

In [65]:
import pandas as pd
exam_data = {
    "Math": [90, 80, 70],
    "English": [98, 89, 95],
    "Music": [85, 95, 100],
    "Gym": [100, 90, 90]
}

In [66]:
df = pd.DataFrame(exam_data, index=["서준", "우현", "인아"])

In [67]:
df

    Math  English  Music  Gym
서준    90       98     85  100
우현    80       89     95   90
인아    70       95    100   90

In [68]:
label1 = df.loc["서준"]
position1 = df.iloc[0]

In [69]:
label1

Math        90
English     98
Music       85
Gym        100
Name: 서준, dtype: int64

In [70]:
position1

Math        90
English     98
Music       85
Gym        100
Name: 서준, dtype: int64

In [71]:
label2 = df.loc[["서준", "우현"]]
position2 = df.iloc[[0, 1]]

In [72]:
label2

    Math  English  Music  Gym
서준    90       98     85  100
우현    80       89     95   90

In [73]:
position2

    Math  English  Music  Gym
서준    90       98     85  100
우현    80       89     95   90

In [74]:
label3 = df.loc["서준":"우현"]
position3 = df.iloc[0:1]

In [75]:
print(label3)
print(position3)

    Math  English  Music  Gym
서준    90       98     85  100
우현    80       89     95   90
    Math  English  Music  Gym
서준    90       98     85  100

In [77]:
exam_data = {
    "Name": ["서준", "우현", "인아"],
    "Math": [90, 80, 70],
    "English": [98, 89, 95],
    "Music": [85, 95, 100],
    "Gym": [100, 90, 90]
}

In [78]:
df = pd.DataFrame(exam_data)

In [79]:
df

  Name  Math  English  Music  Gym
0   서준    90       98     85  100
1   우현    80       89     95   90
2   인아    70       95    100   90

In [80]:
math1 = df["Math"]

In [81]:
english = df.English

In [82]:
print(math1)
print("=" * 80)
print(english)

0    90
1    80
2    70
Name: Math, dtype: int64
================================================================================
0    98
1    89
2    95
Name: English, dtype: int64

In [83]:
print(type(math1))
print("=" * 80)
print(type(english))

<class 'pandas.core.series.Series'>
================================================================================
<class 'pandas.core.series.Series'>

In [85]:
music_gym = df[["Music", "Gym"]]

In [86]:
math2 = df[["Math"]]

In [87]:
print(music_gym)
print("="*80)
print(math2)
print("="*80)
print(type(music_gym))
print("=" * 80)
print(type(math2))

   Music  Gym
0     85  100
1     95   90
2    100   90
================================================================================
   Math
0    90
1    80
2    70
================================================================================
<class 'pandas.core.frame.DataFrame'>
================================================================================
<class 'pandas.core.frame.DataFrame'>

In [88]:
exam_data

{'Name': ['서준', '우현', '인아'],
 'Math': [90, 80, 70],
 'English': [98, 89, 95],
 'Music': [85, 95, 100],
 'Gym': [100, 90, 90]}

In [89]:
df = pd.DataFrame(exam_data)

In [90]:
df = df.set_index("Name")

In [91]:
df

      Math  English  Music  Gym
Name
서준      90       98     85  100
우현      80       89     95   90
인아      70       95    100   90

In [93]:
a = df.loc["서준", "Music"]
b = df.iloc[0, 2]

In [94]:
print("a =", a)
print("b =", b)

a = 85
b = 85

In [95]:
c = df.loc["서준", ["Music", "Gym"]]
d = df.iloc[0, [2, 3]]
e = df.loc["서준", "Music":"Gym"]
f = df.iloc[0, 2:]

In [101]:
print(c)
print(d)
print(e)
print(f)

Music     85
Gym      100
Name: 서준, dtype: int64
Music     85
Gym      100
Name: 서준, dtype: int64
Music     85
Gym      100
Name: 서준, dtype: int64
Music     85
Gym      100
Name: 서준, dtype: int64

In [103]:
g = df.loc[["서준", "우현"], ["Music", "Gym"]]
h = df.iloc[[0, 1], [2, 3]]
i = df.loc["서준":"우현", "Music":"Gym"]
j = df.iloc[0:2, 2:]

In [104]:
print(g)
print(h)
print(i)
print(j)

      Music  Gym
Name
서준       85  100
우현       95   90
      Music  Gym
Name
서준       85  100
우현       95   90
      Music  Gym
Name
서준       85  100
우현       95   90
      Music  Gym
Name
서준       85  100
우현       95   90

In [105]:
exam_data

{'Name': ['서준', '우현', '인아'],
 'Math': [90, 80, 70],
 'English': [98, 89, 95],
 'Music': [85, 95, 100],
 'Gym': [100, 90, 90]}

In [106]:
df

      Math  English  Music  Gym
Name
서준      90       98     85  100
우현      80       89     95   90
인아      70       95    100   90

In [107]:
df["Korean"] = 0

In [108]:
df

      Math  English  Music  Gym  Korean
Name
서준      90       98     85  100       0
우현      80       89     95   90       0
인아      70       95    100   90       0

In [109]:
exam_data = {
    "Name": ["서준", "우현", "인아"],
    "Math": [90, 80, 70],
    "English": [98, 89, 95],
    "Music": [85, 95, 100],
    "Gym": [100, 90, 90]
}

In [110]:
df = pd.DataFrame(exam_data)

In [111]:
df

  Name  Math  English  Music  Gym
0   서준    90       98     85  100
1   우현    80       89     95   90
2   인아    70       95    100   90

In [112]:
df.loc[3] = 0

In [113]:
df

  Name  Math  English  Music  Gym
0   서준    90       98     85  100
1   우현    80       89     95   90
2   인아    70       95    100   90
3    0     0        0      0    0

In [114]:
df.loc[4] = ["동규", 90, 80, 70, 60]

In [115]:
df

  Name  Math  English  Music  Gym
0   서준    90       98     85  100
1   우현    80       89     95   90
2   인아    70       95    100   90
3    0     0        0      0    0
4   동규    90       80     70   60

In [118]:
df.loc["행5"] = df.loc[3]

In [119]:
df

   Name  Math  English  Music  Gym
0    서준    90       98     85  100
1    우현    80       89     95   90
2    인아    70       95    100   90
3     0     0        0      0    0
4    동규    90       80     70   60
5     0     0        0      0    0
행5    0     0        0      0    0

In [125]:
exam_data = {
    "Name": ["서준", "우현", "인아"],
    "Math": [90, 80, 70],
    "English": [98, 89, 95],
    "Music": [85, 95, 100],
    "Gym": [100, 90, 90]
}

In [126]:
df = pd.DataFrame(exam_data)

In [127]:
df

  Name  Math  English  Music  Gym
0   서준    90       98     85  100
1   우현    80       89     95   90
2   인아    70       95    100   90

In [128]:
df = df.set_index("Name")

In [129]:
df

      Math  English  Music  Gym
Name
서준      90       98     85  100
우현      80       89     95   90
인아      70       95    100   90

In [130]:
df.iloc[0][3] = 80

In [131]:
df

      Math  English  Music  Gym
Name
서준      90       98     85   80
우현      80       89     95   90
인아      70       95    100   90

In [132]:
df.loc["서준"]["Gym"] = 90

In [133]:
df

      Math  English  Music  Gym
Name
서준      90       98     85   90
우현      80       89     95   90
인아      70       95    100   90

In [134]:
df.loc["서준", "Gym"] = 100

In [135]:
df

      Math  English  Music  Gym
Name
서준      90       98     85  100
우현      80       89     95   90
인아      70       95    100   90

In [136]:
df.loc["서준",["Music", "Gym"]] = 100, 85

In [137]:
df

      Math  English  Music  Gym
Name
서준      90       98    100   85
우현      80       89     95   90
인아      70       95    100   90

In [138]:
exam_data = {
    "Name": ["서준", "우현", "인아"],
    "Math": [90, 80, 70],
    "English": [98, 89, 95],
    "Music": [85, 95, 100],
    "Gym": [100, 90, 90]
}

In [139]:
df = pd.DataFrame(exam_data)

In [140]:
df

  Name  Math  English  Music  Gym
0   서준    90       98     85  100
1   우현    80       89     95   90
2   인아    70       95    100   90

In [141]:
df = df.transpose()

In [142]:
df

           0   1    2
Name      서준  우현   인아
Math      90  80   70
English   98  89   95
Music     85  95  100
Gym      100  90   90

In [143]:
df = df.T

In [144]:
df

  Name Math English Music  Gym
0   서준   90      98    85  100
1   우현   80      89    95   90
2   인아   70      95   100   90

In [145]:
exam_data = {
    "Name": ["서준", "우현", "인아"],
    "Math": [90, 80, 70],
    "English": [98, 89, 95],
    "Music": [85, 95, 100],
    "Gym": [100, 90, 90]
}

In [146]:
df = pd.DataFrame(exam_data)

In [147]:
ndf = df.set_index(["Name"])

In [148]:
ndf

      Math  English  Music  Gym
Name
서준      90       98     85  100
우현      80       89     95   90
인아      70       95    100   90

In [149]:
ndf2 = ndf.set_index(["Music"])

In [150]:
ndf2

       Math  English  Gym
Music
85       90       98  100
95       80       89   90
100      70       95   90

In [151]:
ndf3 = ndf.set_index(["Math", "Music"])

In [152]:
ndf3

            English  Gym
Math Music
90   85          98  100
80   95          89   90
70   100         95   90

In [162]:
dict_data = {"c0":[1, 2, 3], "c1": [4, 5, 6], "c2":[7, 8, 9], "c3": [10, 11, 12],
            "c4": [13, 14, 15]}

In [168]:
df = pd.DataFrame(dict_data, index=["r0", "r1", "r2"])

In [169]:
df

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15

In [170]:
new_index = ["r0", "r1", "r2", "r3", "r4"]

In [171]:
ndf = df.reindex(new_index)

In [172]:
ndf

     c0   c1   c2    c3    c4
r0  1.0  4.0  7.0  10.0  13.0
r1  2.0  5.0  8.0  11.0  14.0
r2  3.0  6.0  9.0  12.0  15.0
r3  NaN  NaN  NaN   NaN   NaN
r4  NaN  NaN  NaN   NaN   NaN

In [173]:
ndf2 = df.reindex(new_index, fill_value=0)

In [174]:
ndf2

    c0  c1  c2  c3  c4
r0   1   4   7  10  13
r1   2   5   8  11  14
r2   3   6   9  12  15
r3   0   0   0   0   0
r4   0   0   0   0   0